tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/gui'
tap 'homebrew/science'
tap 'homebrew/python'
tap 'homebrew/x11'
tap 'railwaycat/emacsmacport'

brew 'aspell', args: ['with-lang-en']
brew 'git'
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'cmake'
brew 'coreutils'
brew 'python'
brew 'python3'
brew 'fdupes'
brew 'figlet'
brew 'gcc'
brew 'ghostscript'
brew 'git-number'
brew 'global', args: ['with-ctags', 'with-pygments', 'with-sqlite3']
brew 'gnuplot', args: ['with-cairo', 'with-pdflib-lite', 'with-tex', 'with-wxmac']
brew 'htop'
brew 'imagemagick'
brew 'isync'
brew 'maven'
brew 'mercurial'
brew 'ncdu'
brew 'notmuch'
brew 'optipng'
brew 'pandoc'
brew 'parallel'
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'wget'
brew 'homebrew/gui/inkscape'
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-gnutls', 'with-official-icon']
brew 'numpy'
brew 'matplotlib'

cask 'java'
cask 'font-roboto'
cask 'yakyak'
cask 'backblaze'
cask 'darktable'
cask 'dropbox'
cask 'gimp'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'iterm2'
cask 'keepassx'
cask 'lumen'
cask 'omnigraffle'
cask 'skim'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'mactex'
cask 'skype'
cask 'viber'
cask 'virtualbox'
cask 'vlc'
cask 'yakyak'
