tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'dmnc/horology'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/head-only'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/x11'
tap 'railwaycat/emacsmacport'
tap 'ankurdave/ankurdave'

cask 'mactex'
cask 'java'

brew 'ammonite-repl'
brew 'ankurdave/ankurdave/afew', args: ['HEAD']
brew 'aspell', args: ['with-lang-en']
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'cmake'
brew 'coreutils'
brew 'dfu-util'
brew 'emacs-mac', args: ['with-official-icon', 'with-gnutls']
brew 'fdupes'
brew 'ffmpeg'
brew 'figlet'
brew 'gcc'
brew 'ghostscript'
brew 'git'
brew 'git-number'
brew 'global', args: ['with-ctags', 'with-pygments', 'with-sqlite3']
brew 'gnuplot', args: ['with-cairo', 'with-pdflib-lite', 'with-tex', 'with-wxmac']
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'ispell'
brew 'isync'
brew 'matplotlib'
brew 'maven'
brew 'mercurial'
brew 'ncdu'
brew 'node'
brew 'notmuch'
brew 'npm'
brew 'numpy'
brew 'optipng'
brew 'pandoc'
brew 'parallel'
brew 'pdf-tools'
brew 'python'
brew 'python3'
brew 'rsnapshot'
brew 'rsnapshot-once', args: ['HEAD']
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'sctags', args: ['HEAD']
brew 'terraform'
brew 'tg'
brew 'wget'

cask 'backblaze'
cask 'coconutbattery'
cask 'darktable'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'font-roboto'
cask 'gimp'
cask 'google-chrome'
cask 'google-photos-backup'
cask 'inkscape'
cask 'iterm2'
cask 'keepassx'
cask 'lumen'
cask 'microsoft-office'
cask 'omnigraffle'
cask 'skim'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'spotify-notifications'
cask 'transmission'
cask 'viber'
cask 'virtualbox'
cask 'vlc'
cask 'yakyak'
