tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'dmnc/horology'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ankurdave/ankurdave'
tap 'adoptopenjdk/openjdk'
tap 'd12frosted/emacs-plus'

brew 'aspell', args: ['with-lang-en']
brew 'automake'
brew 'bash'
brew 'bash-completion'
brew 'cmake'
brew 'coreutils'
brew 'emacs-plus'
brew 'git'
brew 'git-lfs'
brew 'htop'
brew 'python'
brew 'wget'

cask 'coconutbattery'
cask 'dropbox'
cask 'iterm2'
cask 'keepassxc'
cask 'skim'
cask 'spectacle'
cask 'adoptopenjdk11'

# brew 'ammonite-repl'
# brew 'ankurdave/ankurdave/afew', args: ['HEAD']
# brew 'dfu-util'
# brew 'fdupes'
# brew 'ffmpeg'
# brew 'figlet'
# brew 'gcc'
# brew 'ghostscript'
# brew 'git-number'
# brew 'global', args: ['with-ctags', 'with-pygments', 'with-sqlite3']
# brew 'gnuplot', args: ['with-cairo', 'with-pdflib-lite', 'with-tex', 'with-wxmac']
# brew 'hub'
# brew 'imagemagick'
# brew 'ispell'
# brew 'isync'
# brew 'maven'
# brew 'mercurial'
# brew 'ncdu'
# brew 'node'
# brew 'notmuch'
# brew 'npm'
# brew 'numpy'
# brew 'optipng'
# brew 'pandoc'
# brew 'parallel'
# brew 'pdf-tools'
# brew 'python3'
# brew 'rsnapshot'
# brew 'rsnapshot-once', args: ['HEAD']
# brew 's3cmd'
# brew 'sbt'
# brew 'scala'
# brew 'sctags', args: ['HEAD']
# brew 'terraform'
# brew 'tg'

# cask 'backblaze'
# cask 'darktable'
# cask 'docker'
# cask 'flux'
# cask 'font-roboto'
# cask 'gimp'
# cask 'google-chrome'
# cask 'google-photos-backup'
# cask 'inkscape'
# cask 'java'
# cask 'lumen'
# cask 'mactex'
# cask 'microsoft-office'
# cask 'omnigraffle'
# cask 'skype'
# cask 'slack'
# cask 'spotify'
# cask 'spotify-notifications'
# cask 'transmission'
# cask 'viber'
# cask 'virtualbox'
# cask 'vlc'
# cask 'yakyak'
